In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'city':['dhaka','chattagram','khulna','barisal'],
                  'temp':[38,35,36,37],
                  'windspeed':[6,7,8,9]
    
})
df1

         city  temp  windspeed
0       dhaka    38          6
1  chattagram    35          7
2      khulna    36          8
3     barisal    37          9

In [3]:
df2=pd.DataFrame({'city':['new work','paris','london','istambul'],
                  'temp':[40,36,26,27],
                  'windspeed':[6,10,8,12]
    
})
df2

       city  temp  windspeed
0  new work    40          6
1     paris    36         10
2    london    26          8
3  istambul    27         12

In [4]:
df=pd.merge(df1,df2,on='windspeed',how='outer')#if ypu pass (how=outer) then show all element of the dataframe
df

       city_x  temp_x  windspeed    city_y  temp_y
0       dhaka    38.0          6  new work    40.0
1  chattagram    35.0          7       NaN     NaN
2      khulna    36.0          8    london    26.0
3     barisal    37.0          9       NaN     NaN
4         NaN     NaN         10     paris    36.0
5         NaN     NaN         12  istambul    27.0

In [5]:
df=pd.marge(df1,df2,how='right')
df

AttributeError: module 'pandas' has no attribute 'marge'